{
  "slug": "/projects/e911/why",
  "title": "Why e911?",
  "sections": [
    {
      "title": "Why e911?",
      "content": "1.  **Its FREE for use by all**—donations are welcome from service providers;  \r\n\r\n2.  **Available On-the-Go**—being a “mobile-first” Software-as-a-Service, e911 is fully accessible using the **mobile phone** (whether it is \"features phone\" or a smartphone) among other personal/portable electronic devices anywhere, anytime;  \r\n\r\n3.  **Astoundingly cost effective to operate**—being a Software-as-a-Service, e911 does not require \"dollars\" consuming, very expensive IT infrastructure that are even more expensive to maintain, upgrade, secure and replace.  \r\n\r\n4.  **Advances MULTIMEDIA communications**—e911 service can receive reports in various multimedia file format – **text, voice **(i.e. call, podcast, Voice Over Internet Protocol – VOIP), **photo, video, and LIVE-streaming**;  \r\n\r\n5.  **Enables MULTICHANNEL (online-offline) communication**—via **ONLINE** (internet-driven) channels such as Instant messenger _(i.e. Telegram messenger, Facebook messenger, Skype messenger)_, Web, App, etc., and **OFFLINE** (non-internet driven) channels such as Short Messaging Service (SMS) or SmarText, Unstructured Supplementary Service Data (USSD) and SIM ToolKit;  \r\n\r\n6.  **Capable of autonomous tracking of HELP request points**—using Global Position System (GPS) based tracking. _Only available for e911 HELP request made from smartphones with GPS tracking enabled_;  \r\n\r\n7.  **Advances smart neighbourhood watch service and \"I’m Safe!\" notifications**—e911 technology provides for the set up of **neighbourhood eRegistry **and the **activation **of a **neighbourhood e911 ALERT/ALARM notification** in the event of an emergency. Members of a neighbourhood or family can send \"I'm safe!\" notification (emergency roll call) in the event of a natural disaster.  \r\n\r\n8.  **InstantReport files: **Users of the service can create InstantReport files containing a profile of their home and car(s). This will enable the generation of precise, instant HELP request in the event of a burglary or car-snatch.",
      "image": "/assets/images/uploads/e911-why.png"
    },
    {
      "title": "Statement of the Problem",
      "content": "Emergencies place complex demands on communication processes much unlike in non-emergency circumstances. Emergencies often involve escalating, evolving events that demand high performance and flexibility from the systems that provide emergency communication services. Message prioritisation, automation of communication, fast message delivery, communication audit trails, and other capabilities are often required by each unique emergency situation. Inadequate emergency communications capabilities can have consequences that are inconvenient at best and disastrous at worst.\r\n\n\r\n\nToday, modern communication tools such as smartphones, GPS, and text-to-speech (among many others) are changing the way in which people are notified about emergencies. The use of these modern tools also enables the delivery of more specific instructions; so that, instead of merely notifying people about an emergency, it is now possible to provide specific instructions on what to do in order to mitigate the effects of an emergency. Two-way emergency communication between individuals or groups of individuals and a response management service system allows for acknowledgement of receipt messages, provides insight on message reception, tally users that have reached safety among others."
    },
    {
      "title": "Attributes of a good emergency",
      "content": "**Timeliness and speed of delivery**\r\n\r\nIt is critically important that any communication about an emergency be timely and quick to disseminate, in order to mitigate damage or loss of life.\r\n\r\n**Ease of use**\r\n\r\nDuring a crisis, the people who use an ECS need to quickly and easily launch their notifications and they need to be able to do so in a way that securely provides them with confidence and an **intuitive,** familiar and** easy-to-use** interface that can be accessed from any location.** However, in order to support a robust and capable emergency communication ability, this ease of use should not preclude the utilization of a complex, technologically advanced system. **A sufficiently advanced system is required to coordinate multiple components to act in concert, to initiate and propagate emergency communications in any manner of ways.\r\n\r\n**Affordability**\r\n\r\nOverall, the more affordable the cost of procuring, installing, and maintaining an emergency communication system is, the more prolific such systems may become; and the more prolific these systems are, the more likely it is that these systems will be available to aid in times of emergency in more locations. \r\n\r\n**Providing instructions**\r\n\r\nA clearly needed attribute of any modern emergency communication system is the ability to not only provide notification of an emergency, but to also provide clear and actionable instructions for how to respond to an emergency.\r\n\r\n**Specific audiences or recipients**\r\n\r\nEmergencies often require delivery of different versions of the same communication at the same time. For example, in an armed hostage-taking incident, occupants of a building may need to receive instructions to lock and barricade the door until further notice, while first responders to the incident need to be aware of the lockdown instructions and be provided more specific details of the hostage-taking event to inform their actions. By utilizing a single message that segregates content between types of users fewer messages have to be created and sent, which may also save time.\r\n\r\n**Multiple communication paths/redundancy**\r\n\r\nThere should be multiple means of delivering emergency information so that if one fails, others may get through.\r\n\r\n**Interoperability**\r\n\r\nTo support these attributes, a \"unified\" emergency communication system should be able to connect to and communicate with other related systems. The ability to interoperate should also consider the need to be both forward and backward compatible with older and yet-to-be-conceived technologies. Introduction of a system that cannot interoperate with previously deployed equipment creates potentially serious barriers to effective operation.",
      "image": "/assets/images/uploads/statement-of-problem.jpg"
    },
    {
      "title": "Wenger Out!",
      "content": "Arsene Wenger has resigned from Arsenal."
    }
  ],
  "sortCode": "40",
  "relatedLinks": [
    {
      "caption": "e911 USSD Protocols",
      "link": "/pages/projects/e911/protocols"
    },
    {
      "caption": "e911 Objectives",
      "link": "/pages/projects/e911/objectives"
    },
    {
      "caption": "Available Channels",
      "link": "/pages/projects/e911/channels"
    },
    {
      "caption": "About e911",
      "link": "/pages/projects/e911/about"
    },
    {
      "caption": "A2L of Things Women Wellness Health Services (ClinyX GynoSMART)?",
      "link": "/pages/projects/clinyx/gs/about"
    }
  ]
}